{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph, Node, Relationship\n",
    "from  py2neo.ogm import *\n",
    "import pandas as pd\n",
    "import time\n",
    "import numpy as np\n",
    "from tabulate import tabulate\n",
    "import pprint"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "#############################################################################\n",
    "################# Importation de la base de donnée dans Neo4j ###############\n",
    "\n",
    "# En amont :\n",
    "    # 1) Ouvrir Neo4j et créer une nouvel base locale intitulée \"Formule1\"\n",
    "    # 2) avec mot de passe : Neo4j\n",
    "    # 3) La demarrer \n",
    "    # 4) et l'ouvrir \n",
    "\n",
    "############################ CREATION DES TABLES ############################\n",
    "\n",
    "path_to_data = \"/Users/ibrahimasow/Desktop/formula_1/\"\n",
    "\n",
    "graph_db = Graph(\"bolt://127.0.0.1:7687\", auth=(\"neo4j\", \"merlin\"))\n",
    "#graph_db.run(\"MATCH (n) DETACH DELETE n\")\n",
    "# Dans cette partie, nous créeons les tables de données dans Neo4j via Python \n",
    "# à partir de nos documents excels\n",
    "\n",
    "# Lors de la création des tables, nous pouvons modifier leur contenu en séléctionnant \n",
    "# dans le \"Node\" que les informations qui nous interessent. Pour cela, il est important \n",
    "# de diviser son document excel de base (col=l.split(\",\")) et indiquer l'indice des colonnes\n",
    "# que l'on souhaite garder. \n",
    "\n",
    "# Les différentes infos gardées dans chaque table sont indiquées dans le schémas de la base. \n",
    "# Celles en italiques corresspondent à celles que nosu avons enlevées. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "      <th>3</th>\n",
       "      <th>4</th>\n",
       "      <th>5</th>\n",
       "      <th>6</th>\n",
       "      <th>7</th>\n",
       "      <th>8</th>\n",
       "      <th>9</th>\n",
       "      <th>10</th>\n",
       "      <th>...</th>\n",
       "      <th>67</th>\n",
       "      <th>68</th>\n",
       "      <th>69</th>\n",
       "      <th>70</th>\n",
       "      <th>71</th>\n",
       "      <th>72</th>\n",
       "      <th>73</th>\n",
       "      <th>74</th>\n",
       "      <th>75</th>\n",
       "      <th>76</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>circuitId</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>4</td>\n",
       "      <td>5</td>\n",
       "      <td>6</td>\n",
       "      <td>7</td>\n",
       "      <td>8</td>\n",
       "      <td>9</td>\n",
       "      <td>10</td>\n",
       "      <td>...</td>\n",
       "      <td>67</td>\n",
       "      <td>68</td>\n",
       "      <td>69</td>\n",
       "      <td>70</td>\n",
       "      <td>71</td>\n",
       "      <td>72</td>\n",
       "      <td>73</td>\n",
       "      <td>74</td>\n",
       "      <td>75</td>\n",
       "      <td>76</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>name</td>\n",
       "      <td>\"Albert Park Grand Prix Circuit\"</td>\n",
       "      <td>\"Sepang International Circuit\"</td>\n",
       "      <td>\"Bahrain International Circuit\"</td>\n",
       "      <td>\"Circuit de Barcelona-Catalunya\"</td>\n",
       "      <td>\"Istanbul Park\"</td>\n",
       "      <td>\"Circuit de Monaco\"</td>\n",
       "      <td>\"Circuit Gilles Villeneuve\"</td>\n",
       "      <td>\"Circuit de Nevers Magny-Cours\"</td>\n",
       "      <td>\"Silverstone Circuit\"</td>\n",
       "      <td>\"Hockenheimring\"</td>\n",
       "      <td>...</td>\n",
       "      <td>\"Circuit de Pedralbes\"</td>\n",
       "      <td>\"Buddh International Circuit\"</td>\n",
       "      <td>\"Circuit of the Americas\"</td>\n",
       "      <td>\"Red Bull Ring\"</td>\n",
       "      <td>\"Sochi Autodrom\"</td>\n",
       "      <td>\"Port Imperial Street Circuit\"</td>\n",
       "      <td>\"Baku City Circuit\"</td>\n",
       "      <td>\"Hanoi Street Circuit\"</td>\n",
       "      <td>\"Autódromo Internacional do Algarve\"</td>\n",
       "      <td>\"Autodromo Internazionale del Mugello\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>location</td>\n",
       "      <td>\"Melbourne\"</td>\n",
       "      <td>\"Kuala Lumpur\"</td>\n",
       "      <td>\"Sakhir\"</td>\n",
       "      <td>\"Montmeló\"</td>\n",
       "      <td>\"Istanbul\"</td>\n",
       "      <td>\"Monte-Carlo\"</td>\n",
       "      <td>\"Montreal\"</td>\n",
       "      <td>\"Magny Cours\"</td>\n",
       "      <td>\"Silverstone\"</td>\n",
       "      <td>\"Hockenheim\"</td>\n",
       "      <td>...</td>\n",
       "      <td>\"Barcelona\"</td>\n",
       "      <td>\"Uttar Pradesh\"</td>\n",
       "      <td>\"Austin\"</td>\n",
       "      <td>\"Spielburg\"</td>\n",
       "      <td>\"Sochi\"</td>\n",
       "      <td>\"New Jersey\"</td>\n",
       "      <td>\"Baku\"</td>\n",
       "      <td>\"Hanoi\"</td>\n",
       "      <td>\"Portimão\"</td>\n",
       "      <td>\"Mugello\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>country</td>\n",
       "      <td>\"Australia\"</td>\n",
       "      <td>\"Malaysia\"</td>\n",
       "      <td>\"Bahrain\"</td>\n",
       "      <td>\"Spain\"</td>\n",
       "      <td>\"Turkey\"</td>\n",
       "      <td>\"Monaco\"</td>\n",
       "      <td>\"Canada\"</td>\n",
       "      <td>\"France\"</td>\n",
       "      <td>\"UK\"</td>\n",
       "      <td>\"Germany\"</td>\n",
       "      <td>...</td>\n",
       "      <td>\"Spain\"</td>\n",
       "      <td>\"India\"</td>\n",
       "      <td>\"USA\"</td>\n",
       "      <td>\"Austria\"</td>\n",
       "      <td>\"Russia\"</td>\n",
       "      <td>\"USA\"</td>\n",
       "      <td>\"Azerbaijan\"</td>\n",
       "      <td>\"Vietnam\"</td>\n",
       "      <td>\"Portugal\"</td>\n",
       "      <td>\"Italy\"</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>4 rows × 76 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                          1                               2  \\\n",
       "circuitId                                 1                               2   \n",
       "name       \"Albert Park Grand Prix Circuit\"  \"Sepang International Circuit\"   \n",
       "location                        \"Melbourne\"                  \"Kuala Lumpur\"   \n",
       "country                         \"Australia\"                      \"Malaysia\"   \n",
       "\n",
       "                                         3                                 4  \\\n",
       "circuitId                                3                                 4   \n",
       "name       \"Bahrain International Circuit\"  \"Circuit de Barcelona-Catalunya\"   \n",
       "location                          \"Sakhir\"                        \"Montmeló\"   \n",
       "country                          \"Bahrain\"                           \"Spain\"   \n",
       "\n",
       "                         5                    6                            7  \\\n",
       "circuitId                5                    6                            7   \n",
       "name       \"Istanbul Park\"  \"Circuit de Monaco\"  \"Circuit Gilles Villeneuve\"   \n",
       "location        \"Istanbul\"        \"Monte-Carlo\"                   \"Montreal\"   \n",
       "country           \"Turkey\"             \"Monaco\"                     \"Canada\"   \n",
       "\n",
       "                                         8                      9  \\\n",
       "circuitId                                8                      9   \n",
       "name       \"Circuit de Nevers Magny-Cours\"  \"Silverstone Circuit\"   \n",
       "location                     \"Magny Cours\"          \"Silverstone\"   \n",
       "country                           \"France\"                   \"UK\"   \n",
       "\n",
       "                         10  ...                      67  \\\n",
       "circuitId                10  ...                      67   \n",
       "name       \"Hockenheimring\"  ...  \"Circuit de Pedralbes\"   \n",
       "location       \"Hockenheim\"  ...             \"Barcelona\"   \n",
       "country           \"Germany\"  ...                 \"Spain\"   \n",
       "\n",
       "                                      68                         69  \\\n",
       "circuitId                             68                         69   \n",
       "name       \"Buddh International Circuit\"  \"Circuit of the Americas\"   \n",
       "location                 \"Uttar Pradesh\"                   \"Austin\"   \n",
       "country                          \"India\"                      \"USA\"   \n",
       "\n",
       "                        70                71                              72  \\\n",
       "circuitId               70                71                              72   \n",
       "name       \"Red Bull Ring\"  \"Sochi Autodrom\"  \"Port Imperial Street Circuit\"   \n",
       "location       \"Spielburg\"           \"Sochi\"                    \"New Jersey\"   \n",
       "country          \"Austria\"          \"Russia\"                           \"USA\"   \n",
       "\n",
       "                            73                      74  \\\n",
       "circuitId                   73                      74   \n",
       "name       \"Baku City Circuit\"  \"Hanoi Street Circuit\"   \n",
       "location                \"Baku\"                 \"Hanoi\"   \n",
       "country           \"Azerbaijan\"               \"Vietnam\"   \n",
       "\n",
       "                                             75  \\\n",
       "circuitId                                    75   \n",
       "name       \"Autódromo Internacional do Algarve\"   \n",
       "location                             \"Portimão\"   \n",
       "country                              \"Portugal\"   \n",
       "\n",
       "                                               76  \n",
       "circuitId                                      76  \n",
       "name       \"Autodromo Internazionale del Mugello\"  \n",
       "location                                \"Mugello\"  \n",
       "country                                   \"Italy\"  \n",
       "\n",
       "[4 rows x 76 columns]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "# ____# Table circuits #_______\n",
    "circuits = {}\n",
    "\n",
    "with open(path_to_data+\"circuits.csv\", \"r\", errors='ignore', encoding='utf-8') as f:\n",
    "    first = True\n",
    "    for l in f :\n",
    "        if not first:\n",
    "            col = l.split(\",\")\n",
    "            circuits[col[0]] =  Node(\"Circuit\",\n",
    "                                  circuitId = int(col[0]),\n",
    "                                  name = str(col[2]),\n",
    "                                  location=str(col[3]),\n",
    "                                  country=str(col[4]))\n",
    "        else :\n",
    "            first = False\n",
    "pd.DataFrame(circuits)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "      <th>3</th>\n",
       "      <th>4</th>\n",
       "      <th>5</th>\n",
       "      <th>6</th>\n",
       "      <th>7</th>\n",
       "      <th>8</th>\n",
       "      <th>9</th>\n",
       "      <th>10</th>\n",
       "      <th>...</th>\n",
       "      <th>839</th>\n",
       "      <th>840</th>\n",
       "      <th>841</th>\n",
       "      <th>843</th>\n",
       "      <th>844</th>\n",
       "      <th>845</th>\n",
       "      <th>846</th>\n",
       "      <th>847</th>\n",
       "      <th>848</th>\n",
       "      <th>849</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>id</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>4</td>\n",
       "      <td>5</td>\n",
       "      <td>6</td>\n",
       "      <td>7</td>\n",
       "      <td>8</td>\n",
       "      <td>9</td>\n",
       "      <td>10</td>\n",
       "      <td>...</td>\n",
       "      <td>839</td>\n",
       "      <td>840</td>\n",
       "      <td>841</td>\n",
       "      <td>843</td>\n",
       "      <td>844</td>\n",
       "      <td>845</td>\n",
       "      <td>846</td>\n",
       "      <td>847</td>\n",
       "      <td>848</td>\n",
       "      <td>849</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>code</td>\n",
       "      <td>\"HAM\"</td>\n",
       "      <td>\"HEI\"</td>\n",
       "      <td>\"ROS\"</td>\n",
       "      <td>\"ALO\"</td>\n",
       "      <td>\"KOV\"</td>\n",
       "      <td>\"NAK\"</td>\n",
       "      <td>\"BOU\"</td>\n",
       "      <td>\"RAI\"</td>\n",
       "      <td>\"KUB\"</td>\n",
       "      <td>\"GLO\"</td>\n",
       "      <td>...</td>\n",
       "      <td>\"OCO\"</td>\n",
       "      <td>\"STR\"</td>\n",
       "      <td>\"GIO\"</td>\n",
       "      <td>\"HAR\"</td>\n",
       "      <td>\"LEC\"</td>\n",
       "      <td>\"SIR\"</td>\n",
       "      <td>\"NOR\"</td>\n",
       "      <td>\"RUS\"</td>\n",
       "      <td>\"ALB\"</td>\n",
       "      <td>\"LAT\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>name</td>\n",
       "      <td>\"Lewis\"</td>\n",
       "      <td>\"Nick\"</td>\n",
       "      <td>\"Nico\"</td>\n",
       "      <td>\"Fernando\"</td>\n",
       "      <td>\"Heikki\"</td>\n",
       "      <td>\"Kazuki\"</td>\n",
       "      <td>\"Sébastien\"</td>\n",
       "      <td>\"Kimi\"</td>\n",
       "      <td>\"Robert\"</td>\n",
       "      <td>\"Timo\"</td>\n",
       "      <td>...</td>\n",
       "      <td>\"Esteban\"</td>\n",
       "      <td>\"Lance\"</td>\n",
       "      <td>\"Antonio\"</td>\n",
       "      <td>\"Brendon\"</td>\n",
       "      <td>\"Charles\"</td>\n",
       "      <td>\"Sergey\"</td>\n",
       "      <td>\"Lando\"</td>\n",
       "      <td>\"George\"</td>\n",
       "      <td>\"Alexander\"</td>\n",
       "      <td>\"Nicholas\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>surname</td>\n",
       "      <td>\"Hamilton\"</td>\n",
       "      <td>\"Heidfeld\"</td>\n",
       "      <td>\"Rosberg\"</td>\n",
       "      <td>\"Alonso\"</td>\n",
       "      <td>\"Kovalainen\"</td>\n",
       "      <td>\"Nakajima\"</td>\n",
       "      <td>\"Bourdais\"</td>\n",
       "      <td>\"Räikkönen\"</td>\n",
       "      <td>\"Kubica\"</td>\n",
       "      <td>\"Glock\"</td>\n",
       "      <td>...</td>\n",
       "      <td>\"Ocon\"</td>\n",
       "      <td>\"Stroll\"</td>\n",
       "      <td>\"Giovinazzi\"</td>\n",
       "      <td>\"Hartley\"</td>\n",
       "      <td>\"Leclerc\"</td>\n",
       "      <td>\"Sirotkin\"</td>\n",
       "      <td>\"Norris\"</td>\n",
       "      <td>\"Russell\"</td>\n",
       "      <td>\"Albon\"</td>\n",
       "      <td>\"Latifi\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>birth</td>\n",
       "      <td>\"1985-01-07\"</td>\n",
       "      <td>\"1977-05-10\"</td>\n",
       "      <td>\"1985-06-27\"</td>\n",
       "      <td>\"1981-07-29\"</td>\n",
       "      <td>\"1981-10-19\"</td>\n",
       "      <td>\"1985-01-11\"</td>\n",
       "      <td>\"1979-02-28\"</td>\n",
       "      <td>\"1979-10-17\"</td>\n",
       "      <td>\"1984-12-07\"</td>\n",
       "      <td>\"1982-03-18\"</td>\n",
       "      <td>...</td>\n",
       "      <td>\"1996-09-17\"</td>\n",
       "      <td>\"1998-10-29\"</td>\n",
       "      <td>\"1993-12-14\"</td>\n",
       "      <td>\"1989-11-10\"</td>\n",
       "      <td>\"1997-10-16\"</td>\n",
       "      <td>\"1995-08-27\"</td>\n",
       "      <td>\"1999-11-13\"</td>\n",
       "      <td>\"1998-02-15\"</td>\n",
       "      <td>\"1996-03-23\"</td>\n",
       "      <td>\"1995-06-29\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>nationality</td>\n",
       "      <td>\"British\"</td>\n",
       "      <td>\"German\"</td>\n",
       "      <td>\"German\"</td>\n",
       "      <td>\"Spanish\"</td>\n",
       "      <td>\"Finnish\"</td>\n",
       "      <td>\"Japanese\"</td>\n",
       "      <td>\"French\"</td>\n",
       "      <td>\"Finnish\"</td>\n",
       "      <td>\"Polish\"</td>\n",
       "      <td>\"German\"</td>\n",
       "      <td>...</td>\n",
       "      <td>\"French\"</td>\n",
       "      <td>\"Canadian\"</td>\n",
       "      <td>\"Italian\"</td>\n",
       "      <td>\"New Zealander\"</td>\n",
       "      <td>\"Monegasque\"</td>\n",
       "      <td>\"Russian\"</td>\n",
       "      <td>\"British\"</td>\n",
       "      <td>\"British\"</td>\n",
       "      <td>\"Thai\"</td>\n",
       "      <td>\"Canadian\"</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>6 rows × 848 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                        1             2             3             4  \\\n",
       "id                      1             2             3             4   \n",
       "code                \"HAM\"         \"HEI\"         \"ROS\"         \"ALO\"   \n",
       "name              \"Lewis\"        \"Nick\"        \"Nico\"    \"Fernando\"   \n",
       "surname        \"Hamilton\"    \"Heidfeld\"     \"Rosberg\"      \"Alonso\"   \n",
       "birth        \"1985-01-07\"  \"1977-05-10\"  \"1985-06-27\"  \"1981-07-29\"   \n",
       "nationality     \"British\"      \"German\"      \"German\"     \"Spanish\"   \n",
       "\n",
       "                        5             6             7             8  \\\n",
       "id                      5             6             7             8   \n",
       "code                \"KOV\"         \"NAK\"         \"BOU\"         \"RAI\"   \n",
       "name             \"Heikki\"      \"Kazuki\"   \"Sébastien\"        \"Kimi\"   \n",
       "surname      \"Kovalainen\"    \"Nakajima\"    \"Bourdais\"   \"Räikkönen\"   \n",
       "birth        \"1981-10-19\"  \"1985-01-11\"  \"1979-02-28\"  \"1979-10-17\"   \n",
       "nationality     \"Finnish\"    \"Japanese\"      \"French\"     \"Finnish\"   \n",
       "\n",
       "                        9            10  ...           839           840  \\\n",
       "id                      9            10  ...           839           840   \n",
       "code                \"KUB\"         \"GLO\"  ...         \"OCO\"         \"STR\"   \n",
       "name             \"Robert\"        \"Timo\"  ...     \"Esteban\"       \"Lance\"   \n",
       "surname          \"Kubica\"       \"Glock\"  ...        \"Ocon\"      \"Stroll\"   \n",
       "birth        \"1984-12-07\"  \"1982-03-18\"  ...  \"1996-09-17\"  \"1998-10-29\"   \n",
       "nationality      \"Polish\"      \"German\"  ...      \"French\"    \"Canadian\"   \n",
       "\n",
       "                      841              843           844           845  \\\n",
       "id                    841              843           844           845   \n",
       "code                \"GIO\"            \"HAR\"         \"LEC\"         \"SIR\"   \n",
       "name            \"Antonio\"        \"Brendon\"     \"Charles\"      \"Sergey\"   \n",
       "surname      \"Giovinazzi\"        \"Hartley\"     \"Leclerc\"    \"Sirotkin\"   \n",
       "birth        \"1993-12-14\"     \"1989-11-10\"  \"1997-10-16\"  \"1995-08-27\"   \n",
       "nationality     \"Italian\"  \"New Zealander\"  \"Monegasque\"     \"Russian\"   \n",
       "\n",
       "                      846           847           848           849  \n",
       "id                    846           847           848           849  \n",
       "code                \"NOR\"         \"RUS\"         \"ALB\"         \"LAT\"  \n",
       "name              \"Lando\"      \"George\"   \"Alexander\"    \"Nicholas\"  \n",
       "surname          \"Norris\"     \"Russell\"       \"Albon\"      \"Latifi\"  \n",
       "birth        \"1999-11-13\"  \"1998-02-15\"  \"1996-03-23\"  \"1995-06-29\"  \n",
       "nationality     \"British\"     \"British\"        \"Thai\"    \"Canadian\"  \n",
       "\n",
       "[6 rows x 848 columns]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    " \n",
    "    \n",
    "# ____# Table pilote #_______\n",
    "drivers = {}\n",
    "\n",
    "with open(path_to_data+\"drivers.csv\", \"r\", errors='ignore', encoding='utf-8') as f:\n",
    "    first = True\n",
    "    for l in f :\n",
    "        if not first:\n",
    "            col = l.split(\",\")\n",
    "            drivers[col[0]] =  Node(\"drivers\",\n",
    "                                  id = int(col[0]),\n",
    "                                  code= str(col[3]),\n",
    "                                  name=str(col[4]),\n",
    "                                  surname=str(col[5]),\n",
    "                                  birth=str(col[6]),\n",
    "                                  nationality=str(col[7]))\n",
    "        else :\n",
    "            first = False\n",
    "\n",
    "pd.DataFrame(drivers)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "      <th>3</th>\n",
       "      <th>4</th>\n",
       "      <th>5</th>\n",
       "      <th>6</th>\n",
       "      <th>7</th>\n",
       "      <th>8</th>\n",
       "      <th>9</th>\n",
       "      <th>10</th>\n",
       "      <th>...</th>\n",
       "      <th>1038</th>\n",
       "      <th>1039</th>\n",
       "      <th>1040</th>\n",
       "      <th>1041</th>\n",
       "      <th>1042</th>\n",
       "      <th>1043</th>\n",
       "      <th>1044</th>\n",
       "      <th>1045</th>\n",
       "      <th>1046</th>\n",
       "      <th>1047</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>id</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>4</td>\n",
       "      <td>5</td>\n",
       "      <td>6</td>\n",
       "      <td>7</td>\n",
       "      <td>8</td>\n",
       "      <td>9</td>\n",
       "      <td>10</td>\n",
       "      <td>...</td>\n",
       "      <td>1038</td>\n",
       "      <td>1039</td>\n",
       "      <td>1040</td>\n",
       "      <td>1041</td>\n",
       "      <td>1042</td>\n",
       "      <td>1043</td>\n",
       "      <td>1044</td>\n",
       "      <td>1045</td>\n",
       "      <td>1046</td>\n",
       "      <td>1047</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>year</td>\n",
       "      <td>2009</td>\n",
       "      <td>2009</td>\n",
       "      <td>2009</td>\n",
       "      <td>2009</td>\n",
       "      <td>2009</td>\n",
       "      <td>2009</td>\n",
       "      <td>2009</td>\n",
       "      <td>2009</td>\n",
       "      <td>2009</td>\n",
       "      <td>2009</td>\n",
       "      <td>...</td>\n",
       "      <td>2020</td>\n",
       "      <td>2020</td>\n",
       "      <td>2020</td>\n",
       "      <td>2020</td>\n",
       "      <td>2020</td>\n",
       "      <td>2020</td>\n",
       "      <td>2020</td>\n",
       "      <td>2020</td>\n",
       "      <td>2020</td>\n",
       "      <td>2020</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>tour</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>4</td>\n",
       "      <td>5</td>\n",
       "      <td>6</td>\n",
       "      <td>7</td>\n",
       "      <td>8</td>\n",
       "      <td>9</td>\n",
       "      <td>10</td>\n",
       "      <td>...</td>\n",
       "      <td>8</td>\n",
       "      <td>9</td>\n",
       "      <td>10</td>\n",
       "      <td>11</td>\n",
       "      <td>12</td>\n",
       "      <td>13</td>\n",
       "      <td>14</td>\n",
       "      <td>15</td>\n",
       "      <td>16</td>\n",
       "      <td>17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>circuitId</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>17</td>\n",
       "      <td>3</td>\n",
       "      <td>4</td>\n",
       "      <td>6</td>\n",
       "      <td>5</td>\n",
       "      <td>9</td>\n",
       "      <td>20</td>\n",
       "      <td>11</td>\n",
       "      <td>...</td>\n",
       "      <td>14</td>\n",
       "      <td>76</td>\n",
       "      <td>71</td>\n",
       "      <td>20</td>\n",
       "      <td>75</td>\n",
       "      <td>21</td>\n",
       "      <td>5</td>\n",
       "      <td>3</td>\n",
       "      <td>3</td>\n",
       "      <td>24</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>name</td>\n",
       "      <td>\"Australian Grand Prix\"</td>\n",
       "      <td>\"Malaysian Grand Prix\"</td>\n",
       "      <td>\"Chinese Grand Prix\"</td>\n",
       "      <td>\"Bahrain Grand Prix\"</td>\n",
       "      <td>\"Spanish Grand Prix\"</td>\n",
       "      <td>\"Monaco Grand Prix\"</td>\n",
       "      <td>\"Turkish Grand Prix\"</td>\n",
       "      <td>\"British Grand Prix\"</td>\n",
       "      <td>\"German Grand Prix\"</td>\n",
       "      <td>\"Hungarian Grand Prix\"</td>\n",
       "      <td>...</td>\n",
       "      <td>\"Italian Grand Prix\"</td>\n",
       "      <td>\"Tuscan Grand Prix\"</td>\n",
       "      <td>\"Russian Grand Prix\"</td>\n",
       "      <td>\"Eifel Grand Prix\"</td>\n",
       "      <td>\"Portuguese Grand Prix\"</td>\n",
       "      <td>\"Emilia Romagna Grand Prix\"</td>\n",
       "      <td>\"Turkish Grand Prix\"</td>\n",
       "      <td>\"Bahrain Grand Prix\"</td>\n",
       "      <td>\"Sakhir Grand Prix\"</td>\n",
       "      <td>\"Abu Dhabi Grand Prix\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>date</td>\n",
       "      <td>\"2009-03-29\"</td>\n",
       "      <td>\"2009-04-05\"</td>\n",
       "      <td>\"2009-04-19\"</td>\n",
       "      <td>\"2009-04-26\"</td>\n",
       "      <td>\"2009-05-10\"</td>\n",
       "      <td>\"2009-05-24\"</td>\n",
       "      <td>\"2009-06-07\"</td>\n",
       "      <td>\"2009-06-21\"</td>\n",
       "      <td>\"2009-07-12\"</td>\n",
       "      <td>\"2009-07-26\"</td>\n",
       "      <td>...</td>\n",
       "      <td>\"2020-09-06\"</td>\n",
       "      <td>\"2020-09-13\"</td>\n",
       "      <td>\"2020-09-27\"</td>\n",
       "      <td>\"2020-10-11\"</td>\n",
       "      <td>\"2020-10-25\"</td>\n",
       "      <td>\"2020-11-01\"</td>\n",
       "      <td>\"2020-11-15\"</td>\n",
       "      <td>\"2020-11-29\"</td>\n",
       "      <td>\"2020-12-06\"</td>\n",
       "      <td>\"2020-12-13\"</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>6 rows × 1035 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                 1                       2  \\\n",
       "id                               1                       2   \n",
       "year                          2009                    2009   \n",
       "tour                             1                       2   \n",
       "circuitId                        1                       2   \n",
       "name       \"Australian Grand Prix\"  \"Malaysian Grand Prix\"   \n",
       "date                  \"2009-03-29\"            \"2009-04-05\"   \n",
       "\n",
       "                              3                     4                     5  \\\n",
       "id                            3                     4                     5   \n",
       "year                       2009                  2009                  2009   \n",
       "tour                          3                     4                     5   \n",
       "circuitId                    17                     3                     4   \n",
       "name       \"Chinese Grand Prix\"  \"Bahrain Grand Prix\"  \"Spanish Grand Prix\"   \n",
       "date               \"2009-04-19\"          \"2009-04-26\"          \"2009-05-10\"   \n",
       "\n",
       "                             6                     7                     8  \\\n",
       "id                           6                     7                     8   \n",
       "year                      2009                  2009                  2009   \n",
       "tour                         6                     7                     8   \n",
       "circuitId                    6                     5                     9   \n",
       "name       \"Monaco Grand Prix\"  \"Turkish Grand Prix\"  \"British Grand Prix\"   \n",
       "date              \"2009-05-24\"          \"2009-06-07\"          \"2009-06-21\"   \n",
       "\n",
       "                             9                      10  ...  \\\n",
       "id                           9                      10  ...   \n",
       "year                      2009                    2009  ...   \n",
       "tour                         9                      10  ...   \n",
       "circuitId                   20                      11  ...   \n",
       "name       \"German Grand Prix\"  \"Hungarian Grand Prix\"  ...   \n",
       "date              \"2009-07-12\"            \"2009-07-26\"  ...   \n",
       "\n",
       "                           1038                 1039                  1040  \\\n",
       "id                         1038                 1039                  1040   \n",
       "year                       2020                 2020                  2020   \n",
       "tour                          8                    9                    10   \n",
       "circuitId                    14                   76                    71   \n",
       "name       \"Italian Grand Prix\"  \"Tuscan Grand Prix\"  \"Russian Grand Prix\"   \n",
       "date               \"2020-09-06\"         \"2020-09-13\"          \"2020-09-27\"   \n",
       "\n",
       "                         1041                     1042  \\\n",
       "id                       1041                     1042   \n",
       "year                     2020                     2020   \n",
       "tour                       11                       12   \n",
       "circuitId                  20                       75   \n",
       "name       \"Eifel Grand Prix\"  \"Portuguese Grand Prix\"   \n",
       "date             \"2020-10-11\"             \"2020-10-25\"   \n",
       "\n",
       "                                  1043                  1044  \\\n",
       "id                                1043                  1044   \n",
       "year                              2020                  2020   \n",
       "tour                                13                    14   \n",
       "circuitId                           21                     5   \n",
       "name       \"Emilia Romagna Grand Prix\"  \"Turkish Grand Prix\"   \n",
       "date                      \"2020-11-01\"          \"2020-11-15\"   \n",
       "\n",
       "                           1045                 1046                    1047  \n",
       "id                         1045                 1046                    1047  \n",
       "year                       2020                 2020                    2020  \n",
       "tour                         15                   16                      17  \n",
       "circuitId                     3                    3                      24  \n",
       "name       \"Bahrain Grand Prix\"  \"Sakhir Grand Prix\"  \"Abu Dhabi Grand Prix\"  \n",
       "date               \"2020-11-29\"         \"2020-12-06\"            \"2020-12-13\"  \n",
       "\n",
       "[6 rows x 1035 columns]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "#____# Table courses #_______\n",
    "races = {}\n",
    "\n",
    "with open(path_to_data+\"races.csv\", \"r\") as f:\n",
    "    first = True\n",
    "    for l in f :\n",
    "        if not first:\n",
    "            col = l.split(\",\")\n",
    "            races[col[0]] =  Node(\"Race\",\n",
    "                                  id = int(col[0]),\n",
    "                                  year= int(col[1]),\n",
    "                                  tour=str(col[2]),\n",
    "                                  circuitId=int(col[3]),\n",
    "                                  name=str(col[4]),\n",
    "                                  date=str(col[5])) #rajouter.strip a la fin si marche pas ?\n",
    "        else :\n",
    "            first = False\n",
    "\n",
    "pd.DataFrame(races)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "      <th>3</th>\n",
       "      <th>4</th>\n",
       "      <th>5</th>\n",
       "      <th>6</th>\n",
       "      <th>7</th>\n",
       "      <th>8</th>\n",
       "      <th>9</th>\n",
       "      <th>10</th>\n",
       "      <th>...</th>\n",
       "      <th>24856</th>\n",
       "      <th>24857</th>\n",
       "      <th>24858</th>\n",
       "      <th>24859</th>\n",
       "      <th>24860</th>\n",
       "      <th>24861</th>\n",
       "      <th>24862</th>\n",
       "      <th>24863</th>\n",
       "      <th>24864</th>\n",
       "      <th>24865</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>id</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>4</td>\n",
       "      <td>5</td>\n",
       "      <td>6</td>\n",
       "      <td>7</td>\n",
       "      <td>8</td>\n",
       "      <td>9</td>\n",
       "      <td>10</td>\n",
       "      <td>...</td>\n",
       "      <td>24856</td>\n",
       "      <td>24857</td>\n",
       "      <td>24858</td>\n",
       "      <td>24859</td>\n",
       "      <td>24860</td>\n",
       "      <td>24861</td>\n",
       "      <td>24862</td>\n",
       "      <td>24863</td>\n",
       "      <td>24864</td>\n",
       "      <td>24865</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>race</td>\n",
       "      <td>18</td>\n",
       "      <td>18</td>\n",
       "      <td>18</td>\n",
       "      <td>18</td>\n",
       "      <td>18</td>\n",
       "      <td>18</td>\n",
       "      <td>18</td>\n",
       "      <td>18</td>\n",
       "      <td>18</td>\n",
       "      <td>18</td>\n",
       "      <td>...</td>\n",
       "      <td>1042</td>\n",
       "      <td>1042</td>\n",
       "      <td>1042</td>\n",
       "      <td>1042</td>\n",
       "      <td>1042</td>\n",
       "      <td>1042</td>\n",
       "      <td>1042</td>\n",
       "      <td>1042</td>\n",
       "      <td>1042</td>\n",
       "      <td>1042</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>driver</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>4</td>\n",
       "      <td>5</td>\n",
       "      <td>6</td>\n",
       "      <td>7</td>\n",
       "      <td>8</td>\n",
       "      <td>9</td>\n",
       "      <td>10</td>\n",
       "      <td>...</td>\n",
       "      <td>8</td>\n",
       "      <td>848</td>\n",
       "      <td>846</td>\n",
       "      <td>847</td>\n",
       "      <td>841</td>\n",
       "      <td>825</td>\n",
       "      <td>154</td>\n",
       "      <td>849</td>\n",
       "      <td>826</td>\n",
       "      <td>840</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>constructor</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>4</td>\n",
       "      <td>1</td>\n",
       "      <td>3</td>\n",
       "      <td>5</td>\n",
       "      <td>6</td>\n",
       "      <td>2</td>\n",
       "      <td>7</td>\n",
       "      <td>...</td>\n",
       "      <td>51</td>\n",
       "      <td>9</td>\n",
       "      <td>1</td>\n",
       "      <td>3</td>\n",
       "      <td>51</td>\n",
       "      <td>210</td>\n",
       "      <td>210</td>\n",
       "      <td>3</td>\n",
       "      <td>213</td>\n",
       "      <td>211</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>position</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>4</td>\n",
       "      <td>5</td>\n",
       "      <td>6</td>\n",
       "      <td>7</td>\n",
       "      <td>8</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>...</td>\n",
       "      <td>11</td>\n",
       "      <td>12</td>\n",
       "      <td>13</td>\n",
       "      <td>14</td>\n",
       "      <td>15</td>\n",
       "      <td>16</td>\n",
       "      <td>17</td>\n",
       "      <td>18</td>\n",
       "      <td>19</td>\n",
       "      <td>\\N</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>points</td>\n",
       "      <td>10</td>\n",
       "      <td>8</td>\n",
       "      <td>6</td>\n",
       "      <td>5</td>\n",
       "      <td>4</td>\n",
       "      <td>3</td>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>...</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>laps</td>\n",
       "      <td>58</td>\n",
       "      <td>58</td>\n",
       "      <td>58</td>\n",
       "      <td>58</td>\n",
       "      <td>58</td>\n",
       "      <td>57</td>\n",
       "      <td>55</td>\n",
       "      <td>53</td>\n",
       "      <td>47</td>\n",
       "      <td>43</td>\n",
       "      <td>...</td>\n",
       "      <td>65</td>\n",
       "      <td>65</td>\n",
       "      <td>65</td>\n",
       "      <td>65</td>\n",
       "      <td>65</td>\n",
       "      <td>65</td>\n",
       "      <td>65</td>\n",
       "      <td>64</td>\n",
       "      <td>64</td>\n",
       "      <td>51</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>time</td>\n",
       "      <td>1:34:50.616</td>\n",
       "      <td>+5.478</td>\n",
       "      <td>+8.163</td>\n",
       "      <td>+17.181</td>\n",
       "      <td>+18.014</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>...</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>milliseconds</td>\n",
       "      <td>5690616</td>\n",
       "      <td>5696094</td>\n",
       "      <td>5698779</td>\n",
       "      <td>5707797</td>\n",
       "      <td>5708630</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>...</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "      <td>\\N</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>fastestlap</td>\n",
       "      <td>39</td>\n",
       "      <td>41</td>\n",
       "      <td>41</td>\n",
       "      <td>58</td>\n",
       "      <td>43</td>\n",
       "      <td>50</td>\n",
       "      <td>22</td>\n",
       "      <td>20</td>\n",
       "      <td>15</td>\n",
       "      <td>23</td>\n",
       "      <td>...</td>\n",
       "      <td>60</td>\n",
       "      <td>61</td>\n",
       "      <td>65</td>\n",
       "      <td>62</td>\n",
       "      <td>46</td>\n",
       "      <td>63</td>\n",
       "      <td>59</td>\n",
       "      <td>53</td>\n",
       "      <td>59</td>\n",
       "      <td>45</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>rank</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>5</td>\n",
       "      <td>7</td>\n",
       "      <td>1</td>\n",
       "      <td>14</td>\n",
       "      <td>12</td>\n",
       "      <td>4</td>\n",
       "      <td>9</td>\n",
       "      <td>13</td>\n",
       "      <td>...</td>\n",
       "      <td>15</td>\n",
       "      <td>5</td>\n",
       "      <td>3</td>\n",
       "      <td>13</td>\n",
       "      <td>20</td>\n",
       "      <td>16</td>\n",
       "      <td>17</td>\n",
       "      <td>19</td>\n",
       "      <td>8</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>fastestLapTime</td>\n",
       "      <td>1:27.452</td>\n",
       "      <td>1:27.739</td>\n",
       "      <td>1:28.090</td>\n",
       "      <td>1:28.603</td>\n",
       "      <td>1:27.418</td>\n",
       "      <td>1:29.639</td>\n",
       "      <td>1:29.534</td>\n",
       "      <td>1:27.903</td>\n",
       "      <td>1:28.753</td>\n",
       "      <td>1:29.558</td>\n",
       "      <td>...</td>\n",
       "      <td>1:21.058</td>\n",
       "      <td>1:19.890</td>\n",
       "      <td>1:19.360</td>\n",
       "      <td>1:20.882</td>\n",
       "      <td>1:21.893</td>\n",
       "      <td>1:21.460</td>\n",
       "      <td>1:21.664</td>\n",
       "      <td>1:21.859</td>\n",
       "      <td>1:20.449</td>\n",
       "      <td>1:21.694</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>fastestLapspeed</td>\n",
       "      <td>218.300</td>\n",
       "      <td>217.586</td>\n",
       "      <td>216.719</td>\n",
       "      <td>215.464</td>\n",
       "      <td>218.385</td>\n",
       "      <td>212.974</td>\n",
       "      <td>213.224</td>\n",
       "      <td>217.180</td>\n",
       "      <td>215.100</td>\n",
       "      <td>213.166</td>\n",
       "      <td>...</td>\n",
       "      <td>206.652</td>\n",
       "      <td>209.673</td>\n",
       "      <td>211.073</td>\n",
       "      <td>207.101</td>\n",
       "      <td>204.544</td>\n",
       "      <td>205.632</td>\n",
       "      <td>205.118</td>\n",
       "      <td>204.629</td>\n",
       "      <td>208.216</td>\n",
       "      <td>205.043</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>13 rows × 24860 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                       1         2         3         4         5      \\\n",
       "id                         1         2         3         4         5   \n",
       "race                      18        18        18        18        18   \n",
       "driver                     1         2         3         4         5   \n",
       "constructor                1         2         3         4         1   \n",
       "position                   1         2         3         4         5   \n",
       "points                    10         8         6         5         4   \n",
       "laps                      58        58        58        58        58   \n",
       "time             1:34:50.616    +5.478    +8.163   +17.181   +18.014   \n",
       "milliseconds         5690616   5696094   5698779   5707797   5708630   \n",
       "fastestlap                39        41        41        58        43   \n",
       "rank                       2         3         5         7         1   \n",
       "fastestLapTime      1:27.452  1:27.739  1:28.090  1:28.603  1:27.418   \n",
       "fastestLapspeed      218.300   217.586   216.719   215.464   218.385   \n",
       "\n",
       "                    6         7         8         9         10     ...  \\\n",
       "id                      6         7         8         9        10  ...   \n",
       "race                   18        18        18        18        18  ...   \n",
       "driver                  6         7         8         9        10  ...   \n",
       "constructor             3         5         6         2         7  ...   \n",
       "position                6         7         8        \\N        \\N  ...   \n",
       "points                  3         2         1         0         0  ...   \n",
       "laps                   57        55        53        47        43  ...   \n",
       "time                   \\N        \\N        \\N        \\N        \\N  ...   \n",
       "milliseconds           \\N        \\N        \\N        \\N        \\N  ...   \n",
       "fastestlap             50        22        20        15        23  ...   \n",
       "rank                   14        12         4         9        13  ...   \n",
       "fastestLapTime   1:29.639  1:29.534  1:27.903  1:28.753  1:29.558  ...   \n",
       "fastestLapspeed   212.974   213.224   217.180   215.100   213.166  ...   \n",
       "\n",
       "                    24856     24857     24858     24859     24860     24861  \\\n",
       "id                  24856     24857     24858     24859     24860     24861   \n",
       "race                 1042      1042      1042      1042      1042      1042   \n",
       "driver                  8       848       846       847       841       825   \n",
       "constructor            51         9         1         3        51       210   \n",
       "position               11        12        13        14        15        16   \n",
       "points                  0         0         0         0         0         0   \n",
       "laps                   65        65        65        65        65        65   \n",
       "time                   \\N        \\N        \\N        \\N        \\N        \\N   \n",
       "milliseconds           \\N        \\N        \\N        \\N        \\N        \\N   \n",
       "fastestlap             60        61        65        62        46        63   \n",
       "rank                   15         5         3        13        20        16   \n",
       "fastestLapTime   1:21.058  1:19.890  1:19.360  1:20.882  1:21.893  1:21.460   \n",
       "fastestLapspeed   206.652   209.673   211.073   207.101   204.544   205.632   \n",
       "\n",
       "                    24862     24863     24864     24865  \n",
       "id                  24862     24863     24864     24865  \n",
       "race                 1042      1042      1042      1042  \n",
       "driver                154       849       826       840  \n",
       "constructor           210         3       213       211  \n",
       "position               17        18        19        \\N  \n",
       "points                  0         0         0         0  \n",
       "laps                   65        64        64        51  \n",
       "time                   \\N        \\N        \\N        \\N  \n",
       "milliseconds           \\N        \\N        \\N        \\N  \n",
       "fastestlap             59        53        59        45  \n",
       "rank                   17        19         8        18  \n",
       "fastestLapTime   1:21.664  1:21.859  1:20.449  1:21.694  \n",
       "fastestLapspeed   205.118   204.629   208.216   205.043  \n",
       "\n",
       "[13 rows x 24860 columns]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "#____# Table Résultats #_______\n",
    "results = {}\n",
    "df = pd.read_csv(path_to_data+\"results.csv\",delimiter=\",\")\n",
    "\n",
    "for index,row in df.iterrows():\n",
    "    #print(row)\n",
    "    results[row['resultId']] = Node(\"Result\",\n",
    "                                id=int(row['resultId']),\n",
    "                                race=int(row[\"raceId\"]),\n",
    "                                driver=int(row[\"driverId\"]),\n",
    "                                constructor=int(row[\"constructorId\"]),\n",
    "                                position=str(row[\"position\"]),\n",
    "                                points=int(row[\"points\"]),\n",
    "                                laps=int(row[\"laps\"]),\n",
    "                                time=str(row[\"time\"]),\n",
    "                                milliseconds=str(row[\"milliseconds\"]),\n",
    "                                fastestlap=str(row[\"fastestLap\"]),\n",
    "                                rank=str(row[\"rank\"]),\n",
    "                                fastestLapTime=str(row[\"fastestLapTime\"]),\n",
    "                                fastestLapspeed=(row[\"fastestLapSpeed\"]))\n",
    "pd.DataFrame(results)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "      <th>3</th>\n",
       "      <th>4</th>\n",
       "      <th>5</th>\n",
       "      <th>6</th>\n",
       "      <th>7</th>\n",
       "      <th>8</th>\n",
       "      <th>9</th>\n",
       "      <th>10</th>\n",
       "      <th>...</th>\n",
       "      <th>204</th>\n",
       "      <th>205</th>\n",
       "      <th>206</th>\n",
       "      <th>207</th>\n",
       "      <th>208</th>\n",
       "      <th>209</th>\n",
       "      <th>210</th>\n",
       "      <th>211</th>\n",
       "      <th>212</th>\n",
       "      <th>213</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td>id</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>4</td>\n",
       "      <td>5</td>\n",
       "      <td>6</td>\n",
       "      <td>7</td>\n",
       "      <td>8</td>\n",
       "      <td>9</td>\n",
       "      <td>10</td>\n",
       "      <td>...</td>\n",
       "      <td>204</td>\n",
       "      <td>205</td>\n",
       "      <td>206</td>\n",
       "      <td>207</td>\n",
       "      <td>208</td>\n",
       "      <td>209</td>\n",
       "      <td>210</td>\n",
       "      <td>211</td>\n",
       "      <td>212</td>\n",
       "      <td>213</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>name</td>\n",
       "      <td>\"McLaren\"</td>\n",
       "      <td>\"BMW Sauber\"</td>\n",
       "      <td>\"Williams\"</td>\n",
       "      <td>\"Renault\"</td>\n",
       "      <td>\"Toro Rosso\"</td>\n",
       "      <td>\"Ferrari\"</td>\n",
       "      <td>\"Toyota\"</td>\n",
       "      <td>\"Super Aguri\"</td>\n",
       "      <td>\"Red Bull\"</td>\n",
       "      <td>\"Force India\"</td>\n",
       "      <td>...</td>\n",
       "      <td>\"Brabham-Alfa Romeo\"</td>\n",
       "      <td>\"Lotus\"</td>\n",
       "      <td>\"Marussia\"</td>\n",
       "      <td>\"Caterham\"</td>\n",
       "      <td>\"Lotus F1\"</td>\n",
       "      <td>\"Manor Marussia\"</td>\n",
       "      <td>\"Haas F1 Team\"</td>\n",
       "      <td>\"Racing Point\"</td>\n",
       "      <td>\"Scuderia Alpha Tauri\"</td>\n",
       "      <td>\"AlphaTauri\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td>nationalityC</td>\n",
       "      <td>\"British\"</td>\n",
       "      <td>\"German\"</td>\n",
       "      <td>\"British\"</td>\n",
       "      <td>\"French\"</td>\n",
       "      <td>\"Italian\"</td>\n",
       "      <td>\"Italian\"</td>\n",
       "      <td>\"Japanese\"</td>\n",
       "      <td>\"Japanese\"</td>\n",
       "      <td>\"Austrian\"</td>\n",
       "      <td>\"Indian\"</td>\n",
       "      <td>...</td>\n",
       "      <td>\"British\"</td>\n",
       "      <td>\"Malaysian\"</td>\n",
       "      <td>\"Russian\"</td>\n",
       "      <td>\"Malaysian\"</td>\n",
       "      <td>\"British\"</td>\n",
       "      <td>\"British\"</td>\n",
       "      <td>\"American\"</td>\n",
       "      <td>\"British\"</td>\n",
       "      <td>\"Italian\"</td>\n",
       "      <td>\"Italian\"</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>3 rows × 211 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                      1             2           3          4             5  \\\n",
       "id                    1             2           3          4             5   \n",
       "name          \"McLaren\"  \"BMW Sauber\"  \"Williams\"  \"Renault\"  \"Toro Rosso\"   \n",
       "nationalityC  \"British\"      \"German\"   \"British\"   \"French\"     \"Italian\"   \n",
       "\n",
       "                      6           7              8           9             10  \\\n",
       "id                    6           7              8           9             10   \n",
       "name          \"Ferrari\"    \"Toyota\"  \"Super Aguri\"  \"Red Bull\"  \"Force India\"   \n",
       "nationalityC  \"Italian\"  \"Japanese\"     \"Japanese\"  \"Austrian\"       \"Indian\"   \n",
       "\n",
       "              ...                   204          205         206          207  \\\n",
       "id            ...                   204          205         206          207   \n",
       "name          ...  \"Brabham-Alfa Romeo\"      \"Lotus\"  \"Marussia\"   \"Caterham\"   \n",
       "nationalityC  ...             \"British\"  \"Malaysian\"   \"Russian\"  \"Malaysian\"   \n",
       "\n",
       "                     208               209             210             211  \\\n",
       "id                   208               209             210             211   \n",
       "name          \"Lotus F1\"  \"Manor Marussia\"  \"Haas F1 Team\"  \"Racing Point\"   \n",
       "nationalityC   \"British\"         \"British\"      \"American\"       \"British\"   \n",
       "\n",
       "                                 212           213  \n",
       "id                               212           213  \n",
       "name          \"Scuderia Alpha Tauri\"  \"AlphaTauri\"  \n",
       "nationalityC               \"Italian\"     \"Italian\"  \n",
       "\n",
       "[3 rows x 211 columns]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "#____# Table Ecuries #_______\n",
    "constructors = {}\n",
    "\n",
    "with open(path_to_data+\"constructors.csv\", \"r\") as f:\n",
    "    first = True\n",
    "    for l in f :\n",
    "        if not first:\n",
    "            col = l.split(\",\")\n",
    "            constructors[col[0]] =  Node(\"Constructor\",\n",
    "                                  id = int(col[0]),\n",
    "                                  name = str(col[2]),\n",
    "                                  nationalityC=str(col[3])) #rajouter.strip a la fin si marche pas ?\n",
    "        else :\n",
    "            first = False\n",
    "            \n",
    "pd.DataFrame(constructors)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "############################ RELATION ENTRE LES TABLES ############################\n",
    "\n",
    "rel=[]\n",
    "\n",
    "# Dans cette partie nous créeons les relations entre les tables et les noeuds. \n",
    "# La première relation serra plus detaillée dans sa construction afin de servir d'exemple pour la réalisation des suivantes. \n",
    "\n",
    "# Exemple : On va chercher a créer une relation entre la course et le circuit sur lequel elle a lieu\n",
    "\n",
    "# Relation Race-Circuit : \"SUR LE CIRCUIT\" ###\n",
    "# La première étape consiste à importer le document csv ou les deux informations sont reliées (présentes sur sur la même ligne).\n",
    "df = pd.read_csv(path_to_data+\"races.csv\",delimiter=\",\")\n",
    "\n",
    "# Puis le principe consiste à indiquer dans quelle colone (du document csv) on va retrouver l'information.\n",
    "# (On peut le faire par le numéro de la colonne avec l.split ou avec le nom de la colonne)\n",
    "for index,row in df.iterrows():\n",
    "    course = races[str(row['raceId'])]\n",
    "    # Pour l'information concernant la course c'est dans la colonne 'raceId' \n",
    "    # Pour la première ligne, raceId = 1 \n",
    "    circuit = circuits[str(row['circuitId'])]\n",
    "    # Pour l'information concernant le circuit c'est dans la colonne 'circuitId'\n",
    "    # Pour la première ligne du doc csv, circuitId = 1 \n",
    "    \n",
    "    rel.append(Relationship(course,\"SUR LE CIRCUIT \",circuit))\n",
    "    # Ici on lie alors par la relation \"SUR LE CIRCUIT\" \n",
    "    # le noeud de la base circuit, dont le circuitId = 1,  \n",
    "    # avec le noeud de la base races, dont le raceId = 1. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "debut = time.time()\n",
    "    \n",
    "# Les relations suivantes suivent la même méthode/structure\n",
    "    \n",
    "# relation Pilote - Course : \"A PARTICIPE\" ### ok \n",
    "df = pd.read_csv(path_to_data+\"results.csv\",delimiter=\",\")\n",
    "for index,row in df.iterrows():\n",
    "    course = races[str(row['raceId'])]\n",
    "    pilote = drivers[str(row['driverId'])]\n",
    "    rel.append(Relationship(pilote,\"Participated_to\",course))\n",
    "    \n",
    "# Relation Résulats - Pilote ###\n",
    "df = pd.read_csv(path_to_data+\"results.csv\",delimiter=\",\")\n",
    "for index,row in df.iterrows():\n",
    "    resultat = results[row['resultId']]\n",
    "    pilote = drivers[str(row['driverId'])]\n",
    "    rel.append(Relationship(pilote,\"Results\",resultat))\n",
    "\n",
    "# Relation Résulats - Ecurie ###\n",
    "df = pd.read_csv(path_to_data+\"results.csv\",delimiter=\",\")\n",
    "for index,row in df.iterrows():\n",
    "    resultat = results[row['resultId']]\n",
    "    constructeur = constructors[str(row['constructorId'])]\n",
    "    rel.append(Relationship(constructeur,\"Results_constructor\",resultat))\n",
    "    \n",
    "for r in rel :\n",
    "    graph_db.create(r)\n",
    "# Environ 10min donc soyez patients \n",
    "\n",
    "fin = time.time()\n",
    "print(round(fin - debut, 2), \"s\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Get time needed to create whole database "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "ok\n"
     ]
    }
   ],
   "source": [
    "# Check if databse well created \n",
    "from py2neo import Graph\n",
    "graph = Graph(\"bolt://localhost:7687\", auth=(\"neo4j\", \"merlin\"))\n",
    "try:\n",
    "    graph.run(\"Match () Return 1 Limit 1\")\n",
    "    print('ok')\n",
    "except Exception:\n",
    "    print('not ok')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-----------------------------------------------------------------------------------  -------------------------------------------------------------------------------------------------------------  ----------------------------------------------------------------------------------------------------------------------\n",
      "(\"Australian Grand Prix\")-[:SUR LE CIRCUIT  {}]->(\"Albert Park Grand Prix Circuit\")  (_0:Race {circuitId: 1, date: '\"2009-03-29\"', id: 1, name: '\"Australian Grand Prix\"', tour: '1', year: 2009})  (_1:Circuit {circuitId: 1, country: '\"Australia\"', location: '\"Melbourne\"', name: '\"Albert Park Grand Prix Circuit\"'})\n",
      "-----------------------------------------------------------------------------------  -------------------------------------------------------------------------------------------------------------  ----------------------------------------------------------------------------------------------------------------------\n"
     ]
    }
   ],
   "source": [
    "############# COMMANDE pour NEO4J ###################\n",
    "\n",
    "# 1) Get some data # ok\n",
    "print(tabulate(list(graph_db.run(\"MATCH (n1)-[r]->(n2) RETURN r, n1, n2 LIMIT 1\"))))  #'Dans Neo4j'\n",
    "# limite est le nb de noeuds affichés (plus on en affiche plus c'est long)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [],
   "source": [
    "xy = graph_db.run(\"MATCH (n1)-[r]->(n2) RETURN r, n1, n2 LIMIT 1\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "15.87 s\n"
     ]
    }
   ],
   "source": [
    "# 2) Temps pour afficher tout le réseau depuis 1950 # ok\n",
    "debut = time.time()\n",
    "graph_db.run(\"MATCH (n1)-[r]->(n2) RETURN r, n1, n2\")\n",
    "fin = time.time()\n",
    "print(round(fin - debut, 2), \"s\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "ename": "ValueError",
     "evalue": "Missing keys",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mAttributeError\u001b[0m                            Traceback (most recent call last)",
      "\u001b[0;32m~/opt/anaconda3/lib/python3.7/site-packages/py2neo/database/work.py\u001b[0m in \u001b[0;36m__init__\u001b[0;34m(self, records, keys)\u001b[0m\n\u001b[1;32m    889\u001b[0m             \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 890\u001b[0;31m                 \u001b[0mk\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mrecords\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mkeys\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    891\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mAttributeError\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mAttributeError\u001b[0m: 'list' object has no attribute 'keys'",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001b[0;31mValueError\u001b[0m                                Traceback (most recent call last)",
      "\u001b[0;32m~/opt/anaconda3/lib/python3.7/site-packages/IPython/core/formatters.py\u001b[0m in \u001b[0;36m__call__\u001b[0;34m(self, obj)\u001b[0m\n\u001b[1;32m    700\u001b[0m                 \u001b[0mtype_pprinters\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mtype_printers\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    701\u001b[0m                 deferred_pprinters=self.deferred_printers)\n\u001b[0;32m--> 702\u001b[0;31m             \u001b[0mprinter\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mpretty\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mobj\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    703\u001b[0m             \u001b[0mprinter\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mflush\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    704\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mstream\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mgetvalue\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/opt/anaconda3/lib/python3.7/site-packages/IPython/lib/pretty.py\u001b[0m in \u001b[0;36mpretty\u001b[0;34m(self, obj)\u001b[0m\n\u001b[1;32m    400\u001b[0m                         \u001b[0;32mif\u001b[0m \u001b[0mcls\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mobject\u001b[0m\u001b[0;31m \u001b[0m\u001b[0;31m\\\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    401\u001b[0m                                 \u001b[0;32mand\u001b[0m \u001b[0mcallable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcls\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m__dict__\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'__repr__'\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 402\u001b[0;31m                             \u001b[0;32mreturn\u001b[0m \u001b[0m_repr_pprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mobj\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcycle\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    403\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    404\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0m_default_pprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mobj\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcycle\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/opt/anaconda3/lib/python3.7/site-packages/IPython/lib/pretty.py\u001b[0m in \u001b[0;36m_repr_pprint\u001b[0;34m(obj, p, cycle)\u001b[0m\n\u001b[1;32m    695\u001b[0m     \u001b[0;34m\"\"\"A pprint that just redirects to the normal repr function.\"\"\"\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    696\u001b[0m     \u001b[0;31m# Find newlines and replace them with p.break_()\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 697\u001b[0;31m     \u001b[0moutput\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mrepr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mobj\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    698\u001b[0m     \u001b[0;32mfor\u001b[0m \u001b[0midx\u001b[0m\u001b[0;34m,\u001b[0m\u001b[0moutput_line\u001b[0m \u001b[0;32min\u001b[0m \u001b[0menumerate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0moutput\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msplitlines\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    699\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0midx\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/opt/anaconda3/lib/python3.7/site-packages/py2neo/database/work.py\u001b[0m in \u001b[0;36m__repr__\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    367\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    368\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m__repr__\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 369\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mrepr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mpreview\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;36m3\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    370\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    371\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m__next__\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/opt/anaconda3/lib/python3.7/site-packages/py2neo/database/work.py\u001b[0m in \u001b[0;36mpreview\u001b[0;34m(self, limit)\u001b[0m\n\u001b[1;32m    497\u001b[0m                 \u001b[0mvalues\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_hydrant\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhydrate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mkeys\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mvalues\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mentities\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_entities\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mversion\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mv\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    498\u001b[0m             \u001b[0mrecords\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mappend\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mvalues\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 499\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mTable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrecords\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mkeys\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    500\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    501\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mevaluate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mfield\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;36m0\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/opt/anaconda3/lib/python3.7/site-packages/py2neo/database/work.py\u001b[0m in \u001b[0;36m__init__\u001b[0;34m(self, records, keys)\u001b[0m\n\u001b[1;32m    890\u001b[0m                 \u001b[0mk\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mrecords\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mkeys\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    891\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mAttributeError\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 892\u001b[0;31m                 \u001b[0;32mraise\u001b[0m \u001b[0mValueError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Missing keys\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    893\u001b[0m         \u001b[0mwidth\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mlen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mk\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    894\u001b[0m         \u001b[0mt\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;34m[\u001b[0m\u001b[0mset\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mfor\u001b[0m \u001b[0m_\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mrange\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mwidth\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mValueError\u001b[0m: Missing keys"
     ]
    }
   ],
   "source": [
    "# 2) J'enleve toute les courses inférieure aux années 2000 # ok\n",
    "graph_db.run(\"MATCH (c:Race) WHERE c.year<2000 OPTIONAL MATCH (c)-[r]-() DELETE c,r\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (d:drivers) WHERE d.nationality= 'China' RETURN d\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# 3) Tous les pilotes allemands # ok\n",
    "list(graph_db.run(\"MATCH (d:drivers) WHERE d.nationality= 'German' RETURN d\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "# 4) Toutes les courses réalisé sur le circuit de Monaco # ok \n",
    "list(graph_db.run(\"MATCH (n:Circuit)-[:`SUR LE CIRCUIT `]-(m) Where n.name='Circuit de Monaco' Return n,m\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": []
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 5) Toutes les courses réalisées après 2004 sur le circuit de Silverstone # ok mais pas toutes\n",
    "graph_db.run(\"MATCH (n:Circuit {name:'Silverstone Circuit'})-[:`SUR LE CIRCUIT `]-(course:Race) WHERE course.year>2004 Return course.name, course.year\")\n",
    "# Dans neo4j : MATCH (n:Circuit {name:'Silverstone Circuit'})-[:`SUR LE CIRCUIT `]-(course:Race) WHERE course.year>2004 Return course,n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": []
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 6) Qui a gagné le Grand Prix des USA en 2012 ? Et pour quelle écurie courait - il ? # ok \n",
    "graph_db.run(\"Match (course:Race {name:'United States Grand Prix', year:2012})-[:`A LA COURSE `]-(res:Result {rank:'1.0'}), (pilote:drivers)-[:`RESULTATS PILOTE`]-(res),(ecurie:Constructor)-[:`RESULTATS ECURIE`]-(res) Return pilote.name, pilote.surname, ecurie.name, res.rank, course.name\")\n",
    "# dans neo4j : Match (r:Race {name:'United States Grand Prix', year:2012})-[:`A LA COURSE `]-(res:Result {rank:'1.0'}), (pilote:drivers)-[:`RESULTATS PILOTE`]-(res),(ecurie:Constructor)-[:`RESULTATS ECURIE`]-(res) Return pilote,ecurie"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": []
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "# 7) Avec quelle écurie courait Fernando Alonso au grand prix de Malaisie en 2016 ? # ok \n",
    "graph_db.run(\"Match (r:Race {name:'Malaysian Grand Prix', year:2016})-[:`A LA COURSE `]-(res:Result), (p:drivers {name:'Fernando'})-[:`RESULTATS PILOTE`]-(res),(ecurie:Constructor)-[:`RESULTATS ECURIE`]-(res) Return ecurie.name\")\n",
    "# Dans neo4j : Match (r:Race {name:'Malaysian Grand Prix', year:2016})-[:`A LA COURSE `]-(res:Result), (p:drivers {name:'Fernando'})-[:`RESULTATS PILOTE`]-(res),(ecurie:Constructor)-[:`RESULTATS ECURIE`]-(res) Return ecurie"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Schumi a eu le tps de faire  0  avant de tomber sur une pierre\n"
     ]
    }
   ],
   "source": [
    "# 8) Nombre de course qu'a fait Micheal Schumacher ? # ok\n",
    "schumi_races = list(graph_db.run(\"Match (c:Race)-[:`A PARTICIPE `]-(p:drivers {surname:'Schumacher'}) Return c\"))\n",
    "print(\"Schumi a eu le tps de faire \", int(len(schumi_races)), \" avant de tomber sur une pierre\")\n",
    "# Dans neo4j : Match (c:Race)-[:`A PARTICIPE `]-(p:drivers {surname:'Schumacher'}) Return c "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": []
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 9) Quelle est la date de la première course de Jaguar ? Quelle était la course ? Sur quel circuit ? Quels étaient les deux pilotes qui les représentaient ? # ok \n",
    "graph_db.run(\"MATCH (e:Constructor {name:'Jaguar'})-[:`RESULTATS ECURIE`]-(res:Result), (course:Race)-[:`A LA COURSE `]-(res) Return min(course.date)\")\n",
    "graph_db.run(\"MATCH (course:Race {date:'2000-03-12'})-[:`SUR LE CIRCUIT `]-(circuit) Return course.name,circuit.name\")\n",
    "graph_db.run(\"MATCH (r:Race {date:'2000-03-12'})-[:`A LA COURSE `]-(f:Result),(f:Result)-[:`RESULTATS ECURIE`]-(e:Constructor  {name:'Jaguar'}),(f:Result)-[:`RESULTATS PILOTE`]-(pilote:drivers), (c:Circuit)-[:`SUR LE CIRCUIT `]-(r:Race) Return pilote.name, pilote.surname\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": []
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 10) Donner le schéma complet pour l'écurie Renault au Grand prix de Singapour, le 17 Septembre 2017 ? # ok \n",
    "#     C'est à dire le circuit de la course, les pilotes alignés par l'écurie, et leurs résultats respectifs. \n",
    "graph_db.run(\"MATCH (course:Race {date:'2017-09-17', name:'Singapore Grand Prix'})-[:`A LA COURSE `]-(res:Result),(res:Result)-[:`RESULTATS ECURIE`]-(ecurie:Constructor {name:'Renault'}),(res:Result)-[:`RESULTATS PILOTE`]-(pilote:drivers), (circuit:Circuit)-[:`SUR LE CIRCUIT `]-(course:Race)Return course.name,res.rank,ecurie.name,pilote.name,pilote.surname,circuit.name\")\n",
    "# Dans neo4j : MATCH (r:Race {date:'2017-09-17', name:'Singapore Grand Prix'})-[:`A LA COURSE `]-(f:Result),(f:Result)-[:`RESULTATS ECURIE`]-(e:Constructor {name:'Renault'}),(f:Result)-[:`RESULTATS PILOTE`]-(p:drivers), (c:Circuit)-[:`SUR LE CIRCUIT `]-(r:Race)Return r,f,e,p,c"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": []
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "# 11) Quels sont les pilotes dont le nom commence par \"Ni\" ? # ok\n",
    "graph_db.run(\"MATCH (pilote:drivers) WHERE pilote.name STARTS WITH 'Ni' RETURN pilote.name, pilote.surname\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": []
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 12) Quel est le classement des pilotes les plsu titrés ? Top 3 pour l'instant # ok\n",
    "graph_db.run(\"Match (p:drivers)-[:`RESULTATS PILOTE`]-(res:Result {rank:'1.0'}) Return count(res) as nbtitre,p.name,p.surname,p.nationality ORDER BY nbtitre desc\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 13) Chemin le plus court entre Mercedes et le circuit d'Istanbul ? Dans neo4j\n",
    "list(graph_db.run(\"MATCH (e:Constructor {name:'Mercedes'}), (c:Circuit {name:'Istanbul Park'}), p=shortestpath((e)-[*]-(c)) Return p\"))\n",
    "# dans neo4j : MATCH (e:Constructor {name:'Mercedes'}), (c:Circuit {name:'Istanbul Park'}), p=shortestpath((e)-[*]-(c)) Return p"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 14) Afficher tout le graph concernant l'écurie McLaren et compter les courses auxquelles l'écurie a participé \n",
    "list(graph_db.run(\"MATCH p =(t { name: 'McLaren' })-->() RETURN p\"))\n",
    "# Dans neo4j : MATCH p =(t { name: 'McLaren' })-->() RETURN p"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
